Repository: JafarAkhondali/warmshowers-Warmshowers.org-securityfix-514022
Catalog: sites/all/modules/contrib/reglang/translations/*.po
Languages: de, hu

source: This is a helper Module that tries to circumvent some Drupal language behaviour problems.
de: Dieses Modul versucht bei der Einstellung zur Mehrsprachigkeit von Drupal hilfe zu leisten.
hu: Ez a kiegészítő modul segít kiküszöbölni a Drupal néhány, a többnyelvű működéssel kapcsolatos hiányosságát.

source: The language if a user uses the sites registration process should be
de: Welche Sprache soll gesetzt werden, wenn ein Benutzer sich anmeldet
hu: Nyelvi beállítások a regisztráció alatt

source: None - This is default Drupal behaviour.
de: Keine - Dies ist Drupal Standard
hu: Nincs - A Drupal alapértelmezés szerinti működése.

source: Current - Current language of the site. Probably what you want.
de: Aktuelle - Die Sprache, in der die Seite gerade angezeigt wird. Dies ist wahrscheinlich das was Sie wollen.
hu: Jelenlegi - A webhely jelenlegi nyelve szerint. Valószínűleg a megfelelő.

source: Default - Default language of the site.
de: Standard - Die Standardsprache der Seite.
hu: Alapértelmezés - A webhely alapértelmezés szerinti nyelve.

source: The language used to mails in if a user is set
de: Welche Sprache soll in Emails benutzt werden, die an einen Benutzer dieser Seite gehen
hu: A levélhez használt nyelv, ha a felhasználó beállította

source: Do nothing - Drupal default behaviour.
de: Keine - Dies ist Drupal Standard
hu: Kikapcsolva - A Drupal alapértelmezés szerinti működése.

source: Current - Language of the user the mail is for. Probably what you want.
de: Aktive - Die Sprache des Benutzers, an den die Email gerichtet ist. Dies ist wahrscheinlich was Sie wollen.
hu: Jelenlegi - A felhasználó nyelvi beállításai szerint. Valószínűleg a megfelelő.

source: If a node is added or updated and has no language / "language neutral" set
de: Wenn ein Node angelegt oder verändert wird und dabei keine Sprache bzw. / "language neutral" ist

source: Current - Force the currently used language.
de: Aktuelle - Die gerade aktive Sprache erzwingen.

source: Default - Force the defaultlanguage of the site.
de: Standard - Die Stadardsprache der Seite erzwingen.

source: Helper module for language settings.
de: Hilfsmodul für Spracheinstellungen

source: Multilanguage
de: Mehrsprachigkeit
hu: Többnyelvűség

source: Registration Language
hu: Regisztrációs nyelv

source: Registration language
hu: Regisztrációs nyelv

source: Decide if a new registered user should have a language set.
hu: Beállítható, hogy egy új felhasználó regisztrálásakor legyenek-e nyelvi beállítások.
